tutorials/RAS/2DChannel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sedFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          2e-5;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  true;

maxCo           0.9;

maxAlphaCo      0.9;

maxDeltaT       1e-3;

libs (
      "libgroovyBC.so"
      "libgroovyStandardBCs.so"
      "libWilcoxOmegaWallFunction.so"
     );

// ************************************************************************* //
